[
  {
    "s": "1",
    "e": "1",
    "title": "Encounter at Farpoint",
    "summary": "Captain Picard takes command of the Enterprise-D. The new crew faces a dilemma at Farpoint Station, and an unknown adversary called \"Q\"."
  },
  {
    "s": "1",
    "e": "3",
    "title": "The Naked Now",
    "summary": "The Enterprise crew is infected with a virus which causes drunk-like symptoms. Data proves himself \"fully functional\" to Tasha."
  },
  {
    "s": "1",
    "e": "4",
    "title": "Code of Honor",
    "summary": "The leader of the Ligonians wants Yar as a wife. A fight to the death ensues between Yar and the Ligonian's First Wife."
  },
  {
    "s": "1",
    "e": "5",
    "title": "The Last Outpost",
    "summary": "The Enterprise deals with some Ferengi, and both get caught on a random planet. Introduction of the Ferengi."
  },
  {
    "s": "1",
    "e": "6",
    "title": "Where No One Has Gone Before",
    "summary": "A Starfleet engineer arrives to upgrade the Enterprise's engines. We meet the Traveller. Picard appoints Wesley an Acting Ensign."
  },
  {
    "s": "1",
    "e": "7",
    "title": "Lonely Among Us",
    "summary": "An energy creature takes over various Enterprise crew."
  },
  {
    "s": "1",
    "e": "8",
    "title": "Justice",
    "summary": "Paradise has thorns. Wesley is sentenced to death."
  },
  {
    "s": "1",
    "e": "9",
    "title": "The Battle",
    "summary": "The Ferengi present Picard with the wreckage of his old ship, the USS Stargazer."
  },
  {
    "s": "1",
    "e": "10",
    "title": "Hide and Q",
    "summary": "Q returns, and gives Riker the power of the Q."
  },
  {
    "s": "1",
    "e": "11",
    "title": "Haven",
    "summary": "Troi has to fulfil her duty - an arranged marriage. First appearance of Lwaxana Troi (Deanna's mother)."
  },
  {
    "s": "1",
    "e": "12",
    "title": "The Big Goodbye",
    "summary": "Picard plays detective Dixon Hill on the holodeck. Naturally, the holodeck malfunctions."
  },
  {
    "s": "1",
    "e": "13",
    "title": "Datalore",
    "summary": "The Enterprise crew find another android, identical to Data: his \"brother\", Lore. Some background on Data."
  },
  {
    "s": "1",
    "e": "14",
    "title": "Angel One",
    "summary": "Riker has some sexy time in a female-dominated society."
  },
  {
    "s": "1",
    "e": "15",
    "title": "11001001",
    "summary": "The crew has some downtime while the Bynars upgrade the Enterprise computer. Riker creates a fantasy woman on the holodeck: Minuet."
  },
  {
    "s": "1",
    "e": "16",
    "title": "Too Short a Season",
    "summary": "The Federaton negotiator, Admiral Jameson, seems to be getting younger..."
  },
  {
    "s": "1",
    "e": "17",
    "title": "When The Bough Breaks",
    "summary": "The Aldeans kidnap some children from the Enterprise during negotiations."
  },
  {
    "s": "1",
    "e": "18",
    "title": "Home Soil",
    "summary": "Terraformers discover unexpected life on a supposedly barren planet."
  },
  {
    "s": "1",
    "e": "19",
    "title": "Coming of Age",
    "summary": "Wesley sits the exams to enter Starfleet Academy, while an Admiral is investigating the Enterprise."
  },
  {
    "s": "1",
    "e": "20",
    "title": "Heart of Glory",
    "summary": "Enterprise takes some Klingons on board. Lots of background on Worf."
  },
  {
    "s": "1",
    "e": "21",
    "title": "The Arsenal of Freedom",
    "summary": "An automated weapons-selling demo. LaForge in command. Picard and Crusher have a moment."
  },
  {
    "s": "1",
    "e": "22",
    "title": "Symbiosis",
    "summary": "Two planets and their medicine trade tests the Prime Directive. Worst anti-drug speech EVER."
  },
  {
    "s": "1",
    "e": "23",
    "title": "Skin of Evil",
    "summary": "Data learns about grief after a crew member dies on an away mission."
  },
  {
    "s": "1",
    "e": "24",
    "title": "We'll Always Have Paris",
    "summary": "Picard meets an old flame, while experiments with non-linear time go awry."
  },
  {
    "s": "1",
    "e": "25",
    "title": "Conspiracy",
    "summary": "Picard investigates a conspiracy at the top levels of Starfleet."
  },
  {
    "s": "1",
    "e": "26",
    "title": "The Neutral Zone",
    "summary": "The Enterprise is sent to investigate what is destroying outposts along the Romulan Neutral Zone. Three humans from 20thC are unfrozen."
  },

  {
    "s": "2",
    "e": "1",
    "title": "The Child",
    "summary": "Troi gets impregnated by an alien. Staff changes: Dr Crusher gone, Dr Pulaski arrives; Worf is Chief of Security; LaForge becomes Chief Engineer; Guinan runs Ten-Forward; Riker grows a beard. Data: \"One is my name; the other is not.\" Uniform change: no collar stripes."
  },
  {
    "s": "2",
    "e": "2",
    "title": "Where Silence Has Lease",
    "summary": "A curious energy entity toys with the Enterprise. Musings on death."
  },
  {
    "s": "2",
    "e": "3",
    "title": "Elementary, Dear Data",
    "summary": "LaForge challenges the holodeck to create an adversary to match Data's Sherlock Holmes. It does: Moriarty."
  },
  {
    "s": "2",
    "e": "4",
    "title": "The Outrageous Okona",
    "summary": "A charming rogue inspires Data to investigate comedy."
  },
  {
    "s": "2",
    "e": "5",
    "title": "Loud As A Whisper",
    "summary": "Troi is attracted to a deaf negotiator."
  },
  {
    "s": "2",
    "e": "6",
    "title": "The Schizoid Man",
    "summary": "The man who mentored Dr Noonian Soong, Data's creator, tries to take over Data's body. This is the only time we see Doctor Selar."
  },
  {
    "s": "2",
    "e": "7",
    "title": "Unnatural Selection",
    "summary": "Pulaski catches an old-age disease from genetically engineered children. The Transporter Chief, who we've seen five times before, finally gets a name: O'Brien."
  },
  {
    "s": "2",
    "e": "8",
    "title": "A Matter Of Honor",
    "summary": "Riker serves aboard a Klingon ship."
  },
  {
    "s": "2",
    "e": "9",
    "title": "The Measure Of A Man",
    "summary": "A hearing to determine Data's personhood. Widely acknowledged as the best episode of the first two seasons of TNG, and one of the best of the series."
  },
  {
    "s": "2",
    "e": "10",
    "title": "The Dauphin",
    "summary": "Wesley falls in love with a girl who's destined to rule a planet."
  },
  {
    "s": "2",
    "e": "11",
    "title": "Contagion",
    "summary": "Enterprise infected by a computer virus. Discover Iconian gateways. First mention of 'Earl Grey'."
  },
  {
    "s": "2",
    "e": "12",
    "title": "The Royale",
    "summary": "Crew discovers a real-life replica of a hotel from an old book."
  },
  {
    "s": "2",
    "e": "13",
    "title": "Time Squared",
    "summary": "A duplicate Picard from six hours in the future arrives and \"present\" Picard must prevent the destruction of the Enterprise."
  },
  {
    "s": "2",
    "e": "14",
    "title": "The Icarus Factor",
    "summary": "Riker is offered a promotion. His estranged father visits. Worf celebrates anniversary of his Rite of Ascension."
  },
  {
    "s": "2",
    "e": "15",
    "title": "Pen Pals",
    "summary": "Data corresponds with a young girl from a doomed planet. Prime Directive."
  },
  {
    "s": "2",
    "e": "16",
    "title": "Q Who",
    "summary": "Q transports Enterprise to meet... the Borg!"
  },
  {
    "s": "2",
    "e": "17",
    "title": "Samaritan Snare",
    "summary": "Picard and Wesley bond while on a shuttle together. Enterprise and Pakleds."
  },
  {
    "s": "2",
    "e": "18",
    "title": "Up The Long Ladder",
    "summary": "Irish Bringloidi refugees help a colony of clones."
  },
  {
    "s": "2",
    "e": "19",
    "title": "Manhunt",
    "summary": "Lwaxana has a hyperactive sex-drive, and is looking for a man. Picard hides in the Dixon Hill holodeck program."
  },
  {
    "s": "2",
    "e": "20",
    "title": "The Emissary",
    "summary": "Worf meets an old flame, K'Ehleyr, and old feelings re-ignite."
  },
  {
    "s": "2",
    "e": "21",
    "title": "Peak Performance",
    "summary": "Picard versus Riker in war games. Data out-competes someone in a table-top game: \"I 'busted him up'!\""
  },
  {
    "s": "2",
    "e": "22",
    "title": "Shades of Gray",
    "summary": "Worst! Episode! Ever! Due to a writers' strike: a clip show."
  },

  {
    "s": "3",
    "e": "1",
    "title": "Evolution",
    "summary": "Wesley carelessly lets his nanites escape, and they evolve. Wesley and his mother get to know each other again. Staff changes: Dr Crusher returns from Starfleet Medical; Dr Pulaski gone; LaForge is Lt. Cmdr.; Worf is Lieutenant. Uniform change: two-piece."
  },
  {
    "s": "3",
    "e": "2",
    "title": "The Ensigns of Command",
    "summary": "Data has to convince colonists to leave their homes, and learns that having authority is not enough to be a leader."
  },
  {
    "s": "3",
    "e": "3",
    "title": "The Survivors",
    "summary": "Two humans mysteriously alone on an obliterated colony. Troi's hearing music and becoming hysterical."
  },
  {
    "s": "3",
    "e": "4",
    "title": "Who Watches The Watchers?",
    "summary": "The proto-Vulcanoid Mintakans discover Federation observers. Prime Directive dilemma. Picard refuses to become a god, making an excellent speech against superstition and ignorance."
  },
  {
    "s": "3",
    "e": "5",
    "title": "The Bonding",
    "summary": "A young orphan boy struggles with his grief. Worf adopts the boy into his House."
  },
  {
    "s": "3",
    "e": "6",
    "title": "Booby Trap",
    "summary": "LaForge has romantic problems, and engineering problems. He creates a hologram of Dr Leah Brahms (from the Daystrom Institute!), and gets confused about which of these problems she's supposed to help him with."
  },
  {
    "s": "3",
    "e": "7",
    "title": "The Enemy",
    "summary": "Worf refuses to help a Romulan, while LaForge works with a Romulan to survive. Romulan Commander Tomalak makes his first appearance."
  },
  {
    "s": "3",
    "e": "8",
    "title": "The Price",
    "summary": "Troi gets into a romance. She and Crusher do that exercise scene. Two Ferengi get stranded in the Delta Quadrant (they'll turn up later in VOY)."
  },
  {
    "s": "3",
    "e": "9",
    "title": "The Vengeance Factor",
    "summary": "Enterprise crew try to mediate a long-standing feud."
  },
  {
    "s": "3",
    "e": "10",
    "title": "The Defector",
    "summary": "A Romulan wants to defect. Tomalak returns."
  },
  {
    "s": "3",
    "e": "11",
    "title": "The Hunted",
    "summary": "A political prisoner reveals a shameful secret about his government."
  },
  {
    "s": "3",
    "e": "12",
    "title": "The High Ground",
    "summary": "Dr Crusher is taken as a hostage by terrorists."
  },
  {
    "s": "3",
    "e": "13",
    "title": "Déjà Q",
    "summary": "Q has been thrown out of the Q Continuum, and chooses to be Human, with Picard. However, Q has made enemies who want revenge. We meet another Q."
  },
  {
    "s": "3",
    "e": "14",
    "title": "A Matter of Perspective",
    "summary": "Riker is accused of murder, and events are examined from different perspectives using the holodeck."
  },
  {
    "s": "3",
    "e": "15",
    "title": "Yesterday's Enterprise",
    "summary": "A favourite episode of fans. The Enterprise-C emerges from a temporal rift, and the timeline changes: among other things, Yar is still Security Chief on the Enterprise-D. Only Guinan knows something is wrong. Captain Garrett of the Enterprise-C has to make the ultimate choice. An excellent resolution for Yar."
  },
  {
    "s": "3",
    "e": "16",
    "title": "The Offspring",
    "summary": "Data makes an android: a daughter, Lal. Data learns about parenting while Lal learns about life. Excellent Data episode. One of my personal favourites."
  },
  {
    "s": "3",
    "e": "17",
    "title": "Sins of the Father",
    "summary": "Worf's long-dead father, Mogh, is accused of treason by the Klingons, and Worf has to make some tough choices. We meet Worf's borther Kurn. The House of Duras returns."
  },
  {
    "s": "3",
    "e": "18",
    "title": "Allegiance",
    "summary": "Picard is kidnapped and has to work with three other prisoners. Meanwhile, on the Enterprise, Picard is acting strangely."
  },
  {
    "s": "3",
    "e": "19",
    "title": "Captain's Holiday",
    "summary": "Picard gets caught up in adventures and a romance while on holiday on Risa. First appearance of Vash."
  },
  {
    "s": "3",
    "e": "20",
    "title": "Tin Man",
    "summary": "A telepath comes on board to help the Enterprise investigate a space-borne lifeform."
  },
  {
    "s": "3",
    "e": "21",
    "title": "Hollow Pursuits",
    "summary": "Lieutenant Broccoli Barclay has an addiction to using the holodeck - with some embarrassing moments for his fellow crewmembers. First appearance of Barclay"
  },
  {
    "s": "3",
    "e": "22",
    "title": "The Most Toys",
    "summary": "Data is captured - just to be part of someone's collection."
  },
  {
    "s": "3",
    "e": "23",
    "title": "Sarek",
    "summary": "Sarek, Spock's father, comes aboard the Enterprise for one final diplomatic mission. Picard has to help Sarek, and forms a strong bond with him. Excellent moments for Picard and Sarek."
  },
  {
    "s": "3",
    "e": "24",
    "title": "Ménage à Troi",
    "summary": "Lwaxana Troi is kidnapped by a Ferengi, and Picard has to declare his love for her to rescue her. Wesley leaves for Starfleet Academy. This episode includes this well-known Picard meme image, which is not him saying \"WTF?\" but instead quoting Shakespeare."
  },
  {
    "s": "3",
    "e": "25",
    "title": "Transfigurations",
    "summary": "A mystery man starts developing new powers."
  },
  {
    "s": "3",
    "e": "26",
    "title": "The Best of Both Worlds: Parts 1 & 2",
    "summary": "Widely acknowledged as one of the best episodes of TNG. The Borg invade Federation space, heading for Earth. Commander Shelby joins the Enterprise, and challenges Commander Riker. Picard is captured by the Borg and... [The first cliffhanger season-ending.]"
  },

  {
    "s": "4",
    "e": "2",
    "title": "Family",
    "summary": "Picard deals with the emotional consequences of his time with the Borg with help from his brother. Worf's parents come to visit. Wesley sees a message from his late father. Staff: Riker is Commander again; O'Brien is first described as a Chief Petty Officer (not defined before now)."
  },
  {
    "s": "4",
    "e": "3",
    "title": "Brothers",
    "summary": "Data meets his creator, Doctor Noonian Soong. First mention of the emotion chip."
  },
  {
    "s": "4",
    "e": "4",
    "title": "Suddenly Human",
    "summary": "An orphan Human boy who was raised by a warrior species, is introduced to his Human heritage."
  },
  {
    "s": "4",
    "e": "5",
    "title": "Remember Me",
    "summary": "Crusher notices that Enterprise personnel are vanishing, and has to work out why."
  },
  {
    "s": "4",
    "e": "6",
    "title": "Legacy",
    "summary": "Yar's sister asks for the Enterprise's help in a civil war."
  },
  {
    "s": "4",
    "e": "7",
    "title": "Reunion",
    "summary": "Picard is appointed Arbiter of Succession by the dying Klingon Chancellor, and must find who killed the Chancellor. Worf is reunited with K'Ehleyr - and her young son."
  },
  {
    "s": "4",
    "e": "8",
    "title": "Future Imperfect",
    "summary": "Riker wakes up sixteen years older, with no memory of the past sixteen years. He has to refamiliarise himself with his life, with the help of Admiral Picard, First Officer Data - and his own son Jean-Luc. Minuet."
  },
  {
    "s": "4",
    "e": "9",
    "title": "Final Mission",
    "summary": "Wesley and Picard have some time to bond before Wesley leaves for Starfleet Academy. Wesley's last regular appearance in the series."
  },
  {
    "s": "4",
    "e": "10",
    "title": "The Loss",
    "summary": "Troi loses her empathic abilities. First mention of the Breen."
  },
  {
    "s": "4",
    "e": "11",
    "title": "Data's Day",
    "summary": "Data records his personal log of an ordinary day on the Enterprise. He tries to mediate between O'Brien and his fiancee (first appearance of Keiko) in the days before their wedding. He learns to dance for the wedding. A fan favourite."
  },
  {
    "s": "4",
    "e": "12",
    "title": "The Wounded",
    "summary": "A rogue Starfleet captain may possibly cause a new war between the Federation and the Cardassians. First appearance of Cardassians."
  },
  {
    "s": "4",
    "e": "13",
    "title": "Devil's Due",
    "summary": "The Devil returns to claim a planet, according to the contract they signed with her."
  },
  {
    "s": "4",
    "e": "14",
    "title": "Clues",
    "summary": "The Enterprise crew seem to have missed a day, and Data is being suspicious."
  },
  {
    "s": "4",
    "e": "15",
    "title": "First Contact",
    "summary": "A pre-warp civilisation discovers an alien hiding among them at the same time as other aliens appear, offering first contact with something called \"the United Federation of Planets\"."
  },
  {
    "s": "4",
    "e": "16",
    "title": "Galaxy's Child",
    "summary": "The real Dr Leah Brahms comes aboard, causing more confusion for LaForge. An orphaned space organism turns to the Enterprise for maternal comfort."
  },
  {
    "s": "4",
    "e": "17",
    "title": "Night Terrors",
    "summary": "The Enterprise gets trapped inside a space rift, and the crew become short-tempered and irrational - except Troi."
  },
  {
    "s": "4",
    "e": "18",
    "title": "Identity Crisis",
    "summary": "Members of an earlier away mission are starting to transform; LaForge is next."
  },
  {
    "s": "4",
    "e": "19",
    "title": "The Nth Degree",
    "summary": "Barclay is still in therapy - but suddenly starts showing unexpected signs of improvement... too much improvement."
  },
  {
    "s": "4",
    "e": "20",
    "title": "Qpid",
    "summary": "Vash returns, causing Picard some embarrassment. Q decides to do Picard a \"favour\", and tries to kindle a romance - in Robin Hood style. But Worf is \"not a Merry Man!\""
  },
  {
    "s": "4",
    "e": "21",
    "title": "The Drumhead",
    "summary": "Admiral Satie investigates sabotage and espionage on board the Enterprise. Picard's famous \"With the first link...\" speech. A classic episode."
  },
  {
    "s": "4",
    "e": "22",
    "title": "Half a Life",
    "summary": "Lwaxana Troi becomes fond of a visiting scientist - who is too old on his world. A very different side of Lwaxana."
  },
  {
    "s": "4",
    "e": "23",
    "title": "The Host",
    "summary": "Crusher gets romantic with a Trill ambassador - but is in for a surprise. The introduction of the Trill."
  },
  {
    "s": "4",
    "e": "24",
    "title": "The Mind's Eye",
    "summary": "LaForge is brainwashed by the Romulans, to cause trouble between the Federation and the Klingons. The first hint of a new character."
  },
  {
    "s": "4",
    "e": "25",
    "title": "In Theory",
    "summary": "Data creates a program for his attempt at a romantic relationship."
  },
  {
    "s": "4",
    "e": "26",
    "title": "Redemption: Parts 1 & 2",
    "summary": "The new Klingon Chancellor is to be installed. Worf attempts to redeem his House. The House of Duras is scheming with... someone surprising... [Another cliffhanger season-ending.] First appearance of Lursa and B'Etor. First appearance of this character."
  },
  {
    "s": "5",
    "e": "2",
    "title": "Darmok",
    "summary": "Picard and a Tamarian captain learn to communicate with each other. One of the quintessential episodes of this series."
  },
  {
    "s": "5",
    "e": "3",
    "title": "Ensign Ro",
    "summary": "The Bajoran, Ro Laren, is reinstated as an Ensign in Starfleet to help Picard deal with Bajoran terrorists. Introduction of Bajorans. First appearance of Ro."
  },
  {
    "s": "5",
    "e": "4",
    "title": "Silicon Avatar",
    "summary": "The Crystalline Entity returns. A mother grieves for her son, lost in the previous Entity attack, and turns to Data."
  },
  {
    "s": "5",
    "e": "5",
    "title": "Disaster",
    "summary": "A disaster wipes out most systems on the Enterprise, with people stranded all over the ship. Troi has to take command on the bridge, and deal with Ro. Worf delivers Keiko's baby. Picard leads a crew of children."
  },
  {
    "s": "5",
    "e": "6",
    "title": "The Game",
    "summary": "Wesley vists the Enterprise, and finds everyone addicted to a video game. Wesley (and Data) save the day."
  },
  {
    "s": "5",
    "e": "7",
    "title": "Unification: Parts 1 & 2",
    "summary": "Ambassador Spock has gone to Romulus, and Picard and Data have to get him back."
  },
  {
    "s": "5",
    "e": "9",
    "title": "A Matter of Time",
    "summary": "A historian from the future comes back to witness a historic event involving the Enterprise."
  },
  {
    "s": "5",
    "e": "10",
    "title": "New Ground",
    "summary": "Worf has to make decisions about his son Alexander. The Enterprise tests the soliton wave as a form of propulsion."
  },
  {
    "s": "5",
    "e": "11",
    "title": "Hero Worship",
    "summary": "An orphaned boy emulates Data."
  },
  {
    "s": "5",
    "e": "12",
    "title": "Violations",
    "summary": "A telepath mind-rapes members of the Enterprise crew, starting with Troi."
  },
  {
    "s": "5",
    "e": "13",
    "title": "The Masterpiece Society",
    "summary": "A genetically engineered perfect society may be in more danger from the Enterprise than the problem the Enterprise is helping with."
  },
  {
    "s": "5",
    "e": "14",
    "title": "Conundrum",
    "summary": "The Enterprise crew all lose their memories, but not their personalities, and must deal with an unknown alien ship."
  },
  {
    "s": "5",
    "e": "15",
    "title": "Power Play",
    "summary": "Data, Troi, and O'Brien are possessed by unknown entities, and take over the ship."
  },
  {
    "s": "5",
    "e": "16",
    "title": "Ethics",
    "summary": "Worf is permanently paralysed. Is it ethical to commit suicide? Is it ethical to perform untried medical procedures?"
  },
  {
    "s": "5",
    "e": "17",
    "title": "The Outcast",
    "summary": "A person from a sexless androgynous species chooses to be female, and is cast out as a pervert."
  },
  {
    "s": "5",
    "e": "18",
    "title": "Cause and Effect",
    "summary": "The Enterprise cycles over and over again through the same events leading to its destruction."
  },
  {
    "s": "5",
    "e": "19",
    "title": "The First Duty",
    "summary": "A member of Wesley's squad at Starfleet Academy is killing in a training accident. Picard visits an old friend at the Academy, Boothby. Picard's famous \"first duty\" speech."
  },
  {
    "s": "5",
    "e": "20",
    "title": "Cost of Living",
    "summary": "Worf is having difficulty being a parent, and asks Troi for help. Lwaxana takes a maternal interest in young Alexander; she's good with children."
  },
  {
    "s": "5",
    "e": "21",
    "title": "The Perfect Mate",
    "summary": "An empathic metamorph causes quite a stir among the male crew members, especially Picard."
  },
  {
    "s": "5",
    "e": "22",
    "title": "Imaginary Friend",
    "summary": "A little girl's imaginary friend becomes a lot less imaginary."
  },
  {
    "s": "5",
    "e": "23",
    "title": "I, Borg",
    "summary": "The Enterprise crew find a single Borg, and try to find out if they can use it to defeat the Borg. In the meantime, the Borg learns about individuality and friendship. Guinan confronts her fears. Picard has an ethical dilemma."
  },
  {
    "s": "5",
    "e": "24",
    "title": "The Next Phase",
    "summary": "LaForge and Ro become \"ghosts\" after a transporter accident."
  },
  {
    "s": "5",
    "e": "25",
    "title": "The Inner Light",
    "summary": "Picard lives a full life, with family and friends, as \"Kamin\". Widely acclaimed as one of the best episodes of the series."
  },
  {
    "s": "5",
    "e": "26",
    "title": "Time's Arrow: Parts 1 & 2",
    "summary": "The Enterprise crew find Data's head which was buried nearly 500 years ago, then investigate a threat to 19th Century San Francisco, and meet Mark Twain and a younger Guinan. [Another cliffhanger season-ending.]"
  },

  {
    "s": "6",
    "e": "2",
    "title": "Realm of Fear",
    "summary": "Barclay is nervous about using the transporters - and then sees a creature during transport."
  },
  {
    "s": "6",
    "e": "3",
    "title": "Man of the People",
    "summary": "An empathic ambassador and his crazy old mother take an interest in Troi."
  },
  {
    "s": "6",
    "e": "4",
    "title": "Relics",
    "summary": "The Enterprise finds a Dyson sphere - and rescue Captain Montogmery Scott (\"Scotty\") from a ship crashed on the sphere's surface."
  },
  {
    "s": "6",
    "e": "5",
    "title": "Schisms",
    "summary": "Members of the crew are getting edgy and skitterish. Includes Data's famous 'Ode to Spot'."
  },
  {
    "s": "6",
    "e": "6",
    "title": "True Q",
    "summary": "A young woman who's been raised as human learns that she is actually a Q."
  },
  {
    "s": "6",
    "e": "7",
    "title": "Rascals",
    "summary": "Picard, Ro, Guinan, and Keiko are accidentally turned into children. This is the final appearance of O'Brien on the Enterprise, before his off-screen transfer to Deep Space Nine."
  },
  {
    "s": "6",
    "e": "8",
    "title": "A Fistful of Datas",
    "summary": "The holodeck breaks (surprise!) while Worf, Troi, and Alexander are playing a Wild West program - with Datas appearing everywhere."
  },
  {
    "s": "6",
    "e": "9",
    "title": "The Quality of Life",
    "summary": "Exocomps - small drilling machines designed to learn and reproduce - are acting unexpectedly."
  },
  {
    "s": "6",
    "e": "10",
    "title": "Chain of Command: Parts 1 & 2",
    "summary": "The Cardassians are mobilising. Picard, Crusher, and Worf are removed from the Enterprise and sent on a secret mission. Captain Jellico is put in command of the Enterprise (first appearance of Admiral Nechayev) to negotiate with the Cardassians. Jellico doesn't get along with the crew or the Cardassians - but he does make Troi start wearing regulation uniforms."
  },
  {
    "s": "6",
    "e": "12",
    "title": "Ship in a Bottle",
    "summary": "Barclay discovers Moriarty in the holodeck's memory and re-activates him. Moriarty holds Picard and the Enterprise hostage, to achieve his freedom."
  },
  {
    "s": "6",
    "e": "13",
    "title": "Aquiel",
    "summary": "LaForge falls in love with a woman who is suspected of murdering a fellow Starfleet officer."
  },
  {
    "s": "6",
    "e": "14",
    "title": "Face of the Enemy",
    "summary": "Troi wakes up and discovers she now looks like a Romulan. She's been kidnapped to help Romulan dissidents by impersonating a Major in the Tal Shiar. First mention of the Tal Shiar. Some good Troi development."
  },
  {
    "s": "6",
    "e": "15",
    "title": "Tapestry",
    "summary": "Q lets Picard change a key moment in his past - and see the consequences of that change."
  },
  {
    "s": "6",
    "e": "16",
    "title": "Birthright: Parts 1 & 2",
    "summary": "Data starts having visions of his \"father\" Doctor Noonien Soong. Worf investigates a rumor that his father Mogh is alive in a Romulan prison camp. Appearance by Bashir: the Enterprise is at Deep Space Nine."
  },
  {
    "s": "6",
    "e": "18",
    "title": "Starship Mine",
    "summary": "Terrorists capture the Enterprise and its crew while the ship is undergoing maintenance."
  },
  {
    "s": "6",
    "e": "19",
    "title": "Lessons",
    "summary": "Picard learns the difficulties of having an \"office romance\" in Starfleet."
  },
  {
    "s": "6",
    "e": "20",
    "title": "The Chase",
    "summary": "Picard's mentor, Professor Galen, has learned something amazing that connects all humanoid species. [This episode gives the in-universe explanation for why most Star Trek aliens look humanoid.]"
  },
  {
    "s": "6",
    "e": "21",
    "title": "Frame of Mind",
    "summary": "Riker is on the Enterprise rehearsing a play about being an insane man in an asylum, and he's in an insane asylum having delusions about being on the Enterprise."
  },
  {
    "s": "6",
    "e": "22",
    "title": "Suspicions",
    "summary": "Crusher has committed unethical acts while investigating a possible murder."
  },
  {
    "s": "6",
    "e": "23",
    "title": "Rightful Heir",
    "summary": "Worf goes to a Klingon monastery for a spiritual retreat, where he meets someone who claims to be the legendary Klingon hero Kahless."
  },
  {
    "s": "6",
    "e": "24",
    "title": "Second Chances",
    "summary": "A transporter accident eight years ago created a duplicate Riker - now called \"Tom\" (from their shared middle name). We see how \"our\" Riker has matured and changed over the past eight years; plus, \"Tom\" Riker is still in love with Troi. Real-life astronaut Dr Mae Jemison has a cameo appearance in this episode."
  },
  {
    "s": "6",
    "e": "25",
    "title": "Timescape",
    "summary": "Picard, Data, La Forge, and Troi have to find out why a time-frozen Romulan warbird is firing on an equally time-frozen Enterprise."
  },
  {
    "s": "6",
    "e": "26",
    "title": "Descent: Parts 1 & 2",
    "summary": "The Enterprise encounters some individual Borg - who have been influenced by Hugh. Data starts getting emotional. [Another cliffhanger season-ending.] Includes a cameo appearance by Dr Stephen Hawking."
  },

  {
    "s": "7",
    "e": "2",
    "title": "Liaisons",
    "summary": "Iyaaran diplomats test Worf's limits, and Troi's limits, on the Enterprise, while Picard is stranded on a desert planet where he finds a woman who says she loves him."
  },
  {
    "s": "7",
    "e": "3",
    "title": "Interface",
    "summary": "LaForge uses an experimental interface that links to his VISOR to investigate a wrecked starship, and sees his supposedly dead mother."
  },
  {
    "s": "7",
    "e": "4",
    "title": "Gambit: Parts 1 & 2",
    "summary": "Riker investigates Picard's death - and ends up kidnapped and working for a crew of mercenaries."
  },
  {
    "s": "7",
    "e": "6",
    "title": "Phantasms",
    "summary": "Data starts having nightmares. This includes the \"Data answering his own phone\" scene."
  },
  {
    "s": "7",
    "e": "7",
    "title": "Dark Page",
    "summary": "Lwaxana is moody and depressed. Troi tries to find out why, and learns a dark secret from their past. We see Troi's Human father for the only time."
  },
  {
    "s": "7",
    "e": "8",
    "title": "Attached",
    "summary": "Picard and Crusher are captured, and have implants attached to their brains, connecting them to each other. Interesting Picard/Crusher insights."
  },
  {
    "s": "7",
    "e": "9",
    "title": "Force of Nature",
    "summary": "Using warp drive is damaging space itself. This is the episode which introduces speed limits for starships."
  },
  {
    "s": "7",
    "e": "10",
    "title": "Inheritance",
    "summary": "Data meets Dr Noonien Soong's wife, Juliana - his \"mother\". We learn about prototypes made before Lore and Data."
  },
  {
    "s": "7",
    "e": "11",
    "title": "Parallels",
    "summary": "Worf keeps slipping between alternate quantum realities, leading to an awesome climactic moment. Also... Worf... and Troi?"
  },
  {
    "s": "7",
    "e": "12",
    "title": "The Pegasus",
    "summary": "It's \"Captain Picard Day\"! Riker works with his former captain to retrieve the 'Pegasus', a ship they worked on which carries a dark secret, before the Romulans find it."
  },
  {
    "s": "7",
    "e": "13",
    "title": "Homeward",
    "summary": "Worf's Human foster brother breaks the Prime Directive."
  },
  {
    "s": "7",
    "e": "14",
    "title": "Sub Rosa",
    "summary": "Crusher's grandmother dies, and Crusher falls in love with the same ghost her grandmother was having a fling with."
  },
  {
    "s": "7",
    "e": "15",
    "title": "Lower Decks",
    "summary": "The Enterprise from the point of view of four Ensigns."
  },
  {
    "s": "7",
    "e": "16",
    "title": "Thine Own Self",
    "summary": "Data gets amnesia while on a low-tech world where he's supposed to save the population. Troi decides to work towards a promotion - and fails the test."
  },
  {
    "s": "7",
    "e": "17",
    "title": "Masks",
    "summary": "Data is possessed by multiple personalities, while the Enterprise becomes a temple."
  },
  {
    "s": "7",
    "e": "18",
    "title": "Eye of the Beholder",
    "summary": "Troi investigates empathic impressions of a death on the Enterprise. And... yes... Worf and Troi."
  },
  {
    "s": "7",
    "e": "19",
    "title": "Genesis",
    "summary": "The crew de-evolves into amphibians, lemurs, lizards, apes..."
  },
  {
    "s": "7",
    "e": "20",
    "title": "Journey's End",
    "summary": "The Enterprise negotiates handing a colony back to the Cardassians. Wesley visits - and finds a new destiny. The end of Wesley's story."
  },
  {
    "s": "7",
    "e": "21",
    "title": "Firstborn",
    "summary": "Worf's son Alexander is approaching the Klingon Rite of Accession, but isn't interested, until a mysterious Klingon warrior helps out. Lursa and B'Etor are scheming again. Quark makes an appearance."
  },
  {
    "s": "7",
    "e": "22",
    "title": "Bloodlines",
    "summary": "Daimon Bok (from first season's 'The Battle') has returned again to seek revenge against Picard. This time, he is going to kill Picard's son [It's okay - Picard didn't know about him, either.] like Picard killed Bok's son."
  },
  {
    "s": "7",
    "e": "23",
    "title": "Emergence",
    "summary": "The Enterprise's computer is developing self-awareness... in the holodeck program to end all holodeck programs."
  },
  {
    "s": "7",
    "e": "24",
    "title": "Preemptive Strike",
    "summary": "Ro goes undercover to infiltrate the Maquis. The end of Ro's story."
  },
  {
    "s": "7",
    "e": "25",
    "title": "All Good Things...",
    "summary": "Picard is jumping randomly between time periods: his first days on the Enterprise; today; decades in the future. He has to solve the same problem in all three time periods, with Q \"helping\". \"It's time to put an end to your trek through the stars.\" <sob>"
  }
]
